---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.ReverseIterator
source: html/cc518c35-e736-c152-140a-534d6d68caea.htm
---
# Autodesk.Revit.DB.CategorySet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CategorySetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.